app/controllers/admin/users_controller.rb

  def index
    @users = User.excluding_archived.order(:email)
---
SELECT "users".* FROM "users"  ORDER BY "users"."email" ASC

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)