app/views/projects/show.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 1]]
---
<ul id='tickets'>
  <% @project.tickets.each do |ticket| %>