app/controllers/projects_controller.rb

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Ok I really wanted a huge name so that I can test this functionality in a good way."], ["updated_at", "2017-04-27 03:28:30.963222"], ["id", 2]]
---
  def update
    if @project.update(project_params)

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["created_at", "2017-04-23 17:42:11.966927"], ["updated_at", "2017-04-23 17:42:11.966927"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save