app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "description", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Testingly"], ["description", "Fucker shit"], ["project_id", 1], ["created_at", "2017-04-30 13:51:10.415887"], ["updated_at", "2017-04-30 13:51:10.415887"]]
---
  def create
    @ticket = @project.tickets.build(ticket_params)
    @ticket.author = current_user
    authorize @ticket, :create?

    if @ticket.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
---
  def set_project
    @project = Project.find(params[:project_id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ? AND "tickets"."id" = ? LIMIT 1  [["project_id", 3], ["id", 3]]
---
  def set_ticket
    @ticket = @project.tickets.find(params[:id])